"""
Дана сторона квадрата a. Найти его периметр P = 4 * a
"""

def aboba(x):
    P = 4 * x
    return P
a = 5
print(f'членов в жопе {aboba(a)}')