"""
Напишите две функции,
одна создает список с числами от 0 до 1000 с фагом 1 через цикл while
"""



def churka():

    i=1
    while i<1001:
        print(i)
        i=i+1

churka()