"""
Напишите функцию для подсчета среднего арифметического числа
всех чисел в списке или кортеже.
"""



a = [1, 2, 3, 7, 8, 9, 69, 1337, 1488]


hueta= sum(a)

soska_nerealka = hueta / len(a) if a else 0

print("Всего хуйни:", hueta)
print("Что то между", soska_nerealka)