"""
Напишите две функции,
одна создает список с числами от 0 до 1000 с фагом 1 через цикл for
"""




def hach():
    haha = []
    for i in range(0, 1001):
        haha.append(i)
        print(i)

hach()