"""
Даны два целых числа: D (день) и M (месяц),
определяющие правильную дату невисокосного года.
Вывести значения D и M для даты,
следующей за указанной.
"""


def next_date(D, M):
    month_days = {1: 31, 2: 28, 3: 31, 4: 30, 5: 31, 6: 30,
                  7: 31, 8: 31, 9: 30, 10: 31, 11: 30, 12: 31}

    match D == month_days[M]:
        case True:
            D, M = 1, 1 if M == 12 else M + 1
        case False:
            D += 1

    return D, M



D, M = map(int, input("Введите день и месяц: ").split())
D, M = next_date(D, M)
print(f"Следующая дата: {D}.{M}")
